
# Задание A Найти результат выражения для произвольных значений
# a,b,c: (a + b * c)**2

a = 5
b = 4
c = 2
result = (a + b * c) ** 2
print("Результат выражения, при значении a = %d, b = %d, и c = %d, будет равен %d" % (a, b, c, result,))
print('=================')

# Задание B Найти результат выражения для произвольных значений
# a,b,c: a - 4 * b / c

a = 19
b = 2
c = 2
result = a - 4 * b / c
print("Результат выражения, при значении a = %d, b = %d, и c = %d, будет равен %d" % (a, b, c, result,))
print('=================')

# Задание C Найти результат выражения для произвольных значений
# a,b,c: (a * b + 4) / (c - 1)

a = 2
b = 3
c = 3
result = (a * b + 4) / (c - 1)
print("Результат выражения, при значении a = %d, b = %d, и c = %d, будет равен %d" % (a, b, c, result,))
print('=================')