# Задание №14
# Написать функцию, которая будет проверять четность некоторого числа

import math

parity = input("Введите число: ")
parity = int(parity)

if parity % 2 == 0:
    print("число парное")
else:
    print("число непарное")


# def parity(number):
#     return
#     number = input("Введите число: ")
#     number = int(number)
#     if number % 2 == 0:
#         print("число парное")
#     else:
#         print("число непарное")

